Show / Hide Table of Contents
Class Parameter
Common parameter of cross-section
Inheritance
System.Object
OpenObject
Parameter
ParameterBool
ParameterDouble
ParameterInt
ParameterReferenceElement
ParameterString
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class Parameter : OpenObject
Properties
Improve this Doc   View Source
Name
Name of property
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source